Vadimatorik/k1986be92qi_starter_pack/lib/MDR32F9_1986ВЕ4_2015/IDE/keil/SVD/MDR1986BE91.svd
        <register derivedFrom="BUF_00_ID">
          <name>BUF_22_ID</name>
          <addressOffset>0x00000360</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_22_DLC</name>
          <addressOffset>0x00000364</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_22_DATAL</name>
          <addressOffset>0x00000368</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_22_DATAH</name>
          <addressOffset>0x0000036C</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_23_ID</name>
          <addressOffset>0x00000370</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_23_DLC</name>
          <addressOffset>0x00000374</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_23_DATAL</name>
          <addressOffset>0x00000378</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_23_DATAH</name>
          <addressOffset>0x0000037C</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_24_ID</name>
          <addressOffset>0x00000380</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_24_DLC</name>
          <addressOffset>0x00000384</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_24_DATAL</name>
          <addressOffset>0x00000388</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_24_DATAH</name>
          <addressOffset>0x0000038C</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_25_ID</name>
          <addressOffset>0x00000390</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_25_DLC</name>
          <addressOffset>0x00000394</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_25_DATAL</name>
          <addressOffset>0x00000398</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_25_DATAH</name>
          <addressOffset>0x0000039C</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_26_ID</name>
          <addressOffset>0x000003A0</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_26_DLC</name>
          <addressOffset>0x000003A4</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_26_DATAL</name>
          <addressOffset>0x000003A8</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_26_DATAH</name>
          <addressOffset>0x000003AC</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_27_ID</name>
          <addressOffset>0x000003B0</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_27_DLC</name>
          <addressOffset>0x000003B4</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_27_DATAL</name>
          <addressOffset>0x000003B8</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_27_DATAH</name>
          <addressOffset>0x000003BC</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_28_ID</name>
          <addressOffset>0x000003C0</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_28_DLC</name>
          <addressOffset>0x000003C4</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_28_DATAL</name>
          <addressOffset>0x000003C8</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_28_DATAH</name>
          <addressOffset>0x000003CC</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_29_ID</name>
          <addressOffset>0x000003D0</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_29_DLC</name>
          <addressOffset>0x000003D4</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_29_DATAL</name>
          <addressOffset>0x000003D8</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_29_DATAH</name>
          <addressOffset>0x000003DC</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_30_ID</name>
          <addressOffset>0x000003E0</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_30_DLC</name>
          <addressOffset>0x000003E4</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_30_DATAL</name>
          <addressOffset>0x000003E8</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_30_DATAH</name>
          <addressOffset>0x000003EC</addressOffset>
        </register>
        <register derivedFrom="BUF_00_ID">
          <name>BUF_31_ID</name>
          <addressOffset>0x000003F0</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DLC">
          <name>BUF_31_DLC</name>
          <addressOffset>0x000003F4</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAL">
          <name>BUF_31_DATAL</name>
          <addressOffset>0x000003F8</addressOffset>
        </register>
        <register derivedFrom="BUF_00_DATAH">
          <name>BUF_31_DATAH</name>
          <addressOffset>0x000003FC</addressOffset>
        </register>
        <register>
          <name>BUF_FILTER00_MASK</name>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>BUF_FILTER00_FILTER</name>
          <addressOffset>0x00000504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
